In [1]:
import pandas as pd
import ast
import json
pd.set_option('display.max_rows', None)

# EDA

In [2]:
def read_parquet_from_gcs(file_names, gcs_prefix, key_path):
    dfs = {}
    for name in file_names:
        path = f"{gcs_prefix}/{name}.parquet"
        dfs[name] = pd.read_parquet(path, storage_options={"token": key_path})
    return dfs


file_list = [
    "accounts_attendance",
    "accounts_blockrecord",
    "accounts_failpaymenthistory",
    "accounts_friendrequest",
    "accounts_group",
    "accounts_nearbyschool",
    "accounts_paymenthistory",
    "accounts_user_contacts",
    "accounts_pointhistory",
    "accounts_school",
    "accounts_timelinereport",
    "accounts_user",
    "accounts_userquestionrecord",
    "accounts_userwithdraw",
    "event_receipts",
    "events",
    "polls_question",
    "polls_questionpiece",
    "polls_questionreport",
    "polls_questionset",
    "polls_usercandidate"
]

gcs_prefix = "gs://codeit-project/votes"
key_path = "./config/key.json"

dfs = read_parquet_from_gcs(file_list, gcs_prefix, key_path)

# 출석 테이블
accounts_attendance = dfs["accounts_attendance"]

# 차단 기록 테이블
accounts_blockrecord = dfs["accounts_blockrecord"]

# 상품 구매 실패 기록 테이블
accounts_failpaymenthistory = dfs["accounts_failpaymenthistory"]

# 친구 요청 테이블
accounts_friendrequest = dfs["accounts_friendrequest"]

# 그룹 테이블
accounts_group = dfs["accounts_group"]

# 근처 학교 테이블
accounts_nearbyschool = dfs["accounts_nearbyschool"]

# 결제 기록 테이블
accounts_paymenthistory = dfs["accounts_paymenthistory"]

# 사용자 연락처 테이블
accounts_user_contacts = dfs["accounts_user_contacts"]

# 포인트 내역 테이블
accounts_pointhistory = dfs["accounts_pointhistory"]

# 학교 정보 테이블
accounts_school = dfs["accounts_school"]

# 타임라인 신고 기록 테이블
accounts_timelinereport = dfs["accounts_timelinereport"]

# 사용자 기본 정보 테이블
accounts_user = dfs["accounts_user"]

# 사용자 질문 응답 기록 테이블
accounts_userquestionrecord = dfs["accounts_userquestionrecord"]

# 회원 탈퇴 기록 테이블
accounts_userwithdraw = dfs["accounts_userwithdraw"]

# 이벤트 영수증 테이블
event_receipts = dfs["event_receipts"]

# 이벤트 테이블
events = dfs["events"]

# 질문 테이블
polls_question = dfs["polls_question"]

# 질문 조각 테이블
polls_questionpiece = dfs["polls_questionpiece"]

# 질문 신고 테이블
polls_questionreport = dfs["polls_questionreport"]

# 질문 세트 테이블
polls_questionset = dfs["polls_questionset"]

# 사용자 후보 응답 테이블
polls_usercandidate = dfs["polls_usercandidate"]

In [3]:
for file_name in file_list:
    print(f'<<<<<<<<<<{file_name}>>>>>>>>>>')
    display(dfs[file_name].head(10))

<<<<<<<<<<accounts_attendance>>>>>>>>>>

   id                               attendance_date_list  user_id
0   1  ["2023-05-27", "2023-05-28", "2023-05-29", "20...  1446852
1   2  ["2023-05-27", "2023-05-29", "2023-05-30", "20...  1359398
2   3  ["2023-05-27", "2023-05-29", "2023-05-30", "20...  1501542
3   4  ["2023-05-27", "2023-05-28", "2023-05-29", "20...  1507767
4   5  ["2023-05-27", "2023-05-28", "2023-05-29", "20...  1287453
5   6  ["2023-05-29", "2023-05-30", "2023-06-01", "20...  1394716
6   7  ["2023-05-27", "2023-05-29", "2023-05-31", "20...  1232022
7   8  ["2023-05-27", "2023-05-29", "2023-05-30", "20...  1497112
8   9  ["2023-05-27", "2023-05-28", "2023-05-29", "20...  1449303
9  10  ["2023-05-27", "2023-05-29", "2023-05-30", "20...  1406666

<<<<<<<<<<accounts_blockrecord>>>>>>>>>>

   id              reason          created_at  block_user_id  user_id
0   1               그냥... 2023-05-04 23:01:53         867483   878476
1   2         친구 사이가 어색해짐 2023-05-05 01:17:08         867190   867564
2   3  나랑 관련 없는 질문을 자꾸 보냄 2023-05-05 01:50:55         875110   875261
3   6               그냥... 2023-05-05 05:21:52         883696   883511
4   7               그냥... 2023-05-05 06:40:34         871349   870177
5   8                  기타 2023-05-05 10:23:15         846967   880109
6   9         친구 사이가 어색해짐 2023-05-05 10:40:29         862748   851631
7  11         친구 사이가 어색해짐 2023-05-05 12:19:37         885588   875490
8  12                  기타 2023-05-05 13:04:31         885794   879662
9  13                  기타 2023-05-05 13:04:42         885794   879662

<<<<<<<<<<accounts_failpaymenthistory>>>>>>>>>>

   id   productId phone_type          created_at  user_id
0   6   heart.200          A 2023-05-14 05:49:22  1055891
1   7   heart.777          A 2023-05-14 08:17:21  1152151
2   8   heart.777          A 2023-05-14 10:11:46   986200
3   9  heart.1000          A 2023-05-14 11:53:09  1028261
4  10   heart.777          A 2023-05-14 12:30:47  1235730
5  11   heart.777          A 2023-05-14 14:17:32  1039257
6  12   heart.777          A 2023-05-14 15:38:04  1203452
7  13   heart.777          A 2023-05-14 16:02:32  1202936
8  14   heart.777          A 2023-05-14 16:58:25  1151775
9  15   heart.777          A 2023-05-15 04:45:10  1060915

<<<<<<<<<<accounts_friendrequest>>>>>>>>>>

,id,status,created_at,updated_at,receive_user_id,send_user_id
0,7,P,2023-04-17 18:29:11,2023-04-17 18:29:11,831962,837521
1,10,A,2023-04-17 18:29:11,2023-04-22 06:02:53,832151,837521
2,11,A,2023-04-17 18:29:11,2023-04-18 19:28:41,832340,837521
3,13,A,2023-04-17 18:29:11,2023-04-19 11:05:04,833041,837521
4,20,P,2023-04-17 18:29:11,2023-04-17 18:29:11,834415,837521
5,21,P,2023-04-17 18:29:11,2023-04-17 18:29:11,834486,837521
6,23,P,2023-04-17 18:29:11,2023-04-17 18:29:11,837338,837521
7,46,A,2023-04-18 06:44:18,2023-06-01 01:14:53,835871,837523
8,53,A,2023-04-19 05:55:30,2023-04-19 08:47:32,835869,837524
9,54,A,2023-04-19 06:06:20,2023-04-19 06:06:31,837530,837532

<<<<<<<<<<accounts_group>>>>>>>>>>

   id  grade  class_num  school_id
0   1      1          1          1
1   8      3          2          1
2   9      3          3          1
3  10      2          2          1
4  11      2          3          1
5  12      2          1          1
6  16      1          1         30
7  17      1          1       5925
8  18      2          2       2363
9  19      1          1       2380

<<<<<<<<<<accounts_nearbyschool>>>>>>>>>>

       id  distance  nearby_school_id  school_id
0  119021  0.004564                 6          7
1  119022  0.010787                13          7
2  119023  0.012928                20          7
3  119024  0.013590                 4          7
4  119025  0.014122                24          7
5  119026  0.014774                25          7
6  119027  0.016050                18          7
7  119028  0.016135                26          7
8  119029  0.018869                27          7
9  119030  0.000000                 7          7

<<<<<<<<<<accounts_paymenthistory>>>>>>>>>>

   id   productId phone_type          created_at  user_id
0   6   heart.777          A 2023-05-13 21:28:34  1211127
1   7   heart.777          A 2023-05-13 21:29:39  1151343
2   8   heart.777          A 2023-05-13 21:31:33  1002147
3   9   heart.777          A 2023-05-13 21:31:39  1095040
4  11   heart.777          A 2023-05-13 21:34:32  1164081
5  12   heart.200          A 2023-05-13 21:39:06  1239225
6  13  heart.4000          A 2023-05-13 21:39:22  1239225
7  14   heart.777          A 2023-05-13 21:43:30   916229
8  15   heart.777          A 2023-05-13 21:43:40  1179497
9  17   heart.777          A 2023-05-13 21:43:57  1084334

<<<<<<<<<<accounts_user_contacts>>>>>>>>>>

      id  contacts_count       invite_user_id_list  user_id
0    259              30                        []  1167696
1   1756              79                        []   863169
2  13742              21                  [854615]   857205
3  13754              29                        []   851431
4  13756              28                  [849318]   855476
5  13784              31                  [855829]  1482744
6  13798              45          [849318, 849421]   854615
7  13807              28                        []   854372
8  13815              26  [855626, 856042, 837947]   858674
9  21155              28                        []   855526

<<<<<<<<<<accounts_pointhistory>>>>>>>>>>

       id  delta_point          created_at  user_id  user_question_record_id
0  790629            9 2023-04-28 12:27:49   849436                 771777.0
1  790652            9 2023-04-28 12:28:02   849436                 771800.0
2  790664            5 2023-04-28 12:28:09   849436                 771812.0
3  790680           13 2023-04-28 12:28:16   849436                 771828.0
4  790703            5 2023-04-28 12:28:26   849436                 771851.0
5  790716           10 2023-04-28 12:28:32   849436                 771864.0
6  790746           12 2023-04-28 12:28:46   847375                 771894.0
7  790761           15 2023-04-28 12:28:55   849436                 771908.0
8  790765           10 2023-04-28 12:28:57   847375                 771912.0
9  790780            9 2023-04-28 12:29:05   847375                 771927.0

<<<<<<<<<<accounts_school>>>>>>>>>>

   id   address  student_count school_type
0   4  충청북도 충주시            239           H
1   5  충청북도 충주시            160           M
2   6  충청북도 충주시            200           H
3   7  충청북도 충주시            114           H
4   8  충청북도 충주시            139           M
5   9  충청북도 충주시              3           H
6  10  충청북도 충주시            159           M
7  11  충청북도 충주시             17           M
8  12  충청북도 충주시            154           M
9  13  충청북도 충주시             80           H

<<<<<<<<<<accounts_timelinereport>>>>>>>>>>

,id,reason,created_at,reported_user_id,user_id,user_question_record_id
0,28,타인을 사칭함,2023-05-06 04:44:57,874587,885082,3920588
1,37,친구를 비하하거나 조롱하는 어투,2023-05-06 05:41:19,881048,881298,4018679
2,46,친구를 비하하거나 조롱하는 어투,2023-05-06 06:26:59,887882,881945,4120914
3,64,허위 사실 언급,2023-05-06 07:07:46,888610,893684,4143049
4,65,허위 사실 언급,2023-05-06 07:07:52,888610,893684,4143049
5,73,허위 사실 언급,2023-05-06 07:24:39,884536,895569,4198891
6,86,허위 사실 언급,2023-05-06 07:49:27,895726,887254,4210703
7,145,허위 사실 언급,2023-05-06 09:28:26,876060,887254,4265440
8,181,허위 사실 언급,2023-05-06 10:01:39,885328,878909,4378751
9,196,허위 사실 언급,2023-05-06 10:18:43,884885,885300,4386618

<<<<<<<<<<accounts_user>>>>>>>>>>

,id,is_superuser,is_staff,gender,point,friend_id_list,is_push_on,created_at,block_user_id_list,hide_user_id_list,ban_status,report_count,alarm_count,pending_chat,pending_votes,group_id
0,831956,1,1,None,600,"[1292473, 913158, 1488461, 1064695, 1043565, 1...",0,2023-03-29 03:44:14.047130,[],[],N,0,0,0,0,NaN
1,831962,0,0,F,2248,"[833025, 832642, 982531, 879496, 838541, 83752...",1,2023-03-29 05:18:56.162368,[],[],N,253,40878,5499,110,12.0
2,832151,0,0,M,1519,"[838785, 982531, 882567, 879496, 838541, 83649...",0,2023-03-29 12:56:34.989468,[],[],N,0,37,0,47,1.0
3,832340,0,0,F,57,"[841345, 982531, 838785, 963714, 882567, 83252...",1,2023-03-29 12:56:35.020790,[],[],N,0,19,0,21,1.0
4,832520,0,0,M,1039,"[874050, 849763, 874212, 844297, 838541, 84004...",0,2023-03-29 12:56:35.049311,[],[],N,0,29,0,15,12.0
5,832614,0,0,M,1048,"[838541, 833041, 832151, 837806, 1437874, 1142...",1,2023-03-29 12:56:35.064406,[],[],N,0,28,0,14,12.0
6,832740,0,0,M,1094,"[874050, 849763, 832894, 832614, 837806, 83304...",0,2023-03-29 13:20:46.429584,[],[],NB,0,26,0,3,12.0
7,832857,0,0,M,1439,"[874050, 832894, 832740, 832614, 837806, 83304...",1,2023-03-29 13:20:46.460241,[],[],N,0,28,0,16,12.0
8,832894,0,0,M,1535,"[982531, 879496, 833041, 832151, 1082907, 1426...",1,2023-03-29 13:20:46.469788,[],[],N,0,36,0,24,1.0
9,832920,0,0,F,213,"[982531, 882567, 836496, 833041, 836498, 83215...",1,2023-03-29 13:20:46.476550,[],[],N,0,35,0,18,1.0

<<<<<<<<<<accounts_userquestionrecord>>>>>>>>>>

,id,status,created_at,chosen_user_id,question_id,user_id,question_piece_id,has_read,answer_status,answer_updated_at,report_count,opened_times
0,771777,C,2023-04-28 12:27:49,849469,252,849436,998458,0,N,2023-04-28 12:27:49,0,0
1,771800,C,2023-04-28 12:28:02,849446,244,849436,998459,0,N,2023-04-28 12:28:02,0,0
2,771812,C,2023-04-28 12:28:09,849454,183,849436,998460,1,N,2023-04-28 12:28:09,0,0
3,771828,C,2023-04-28 12:28:16,847375,101,849436,998461,0,N,2023-04-28 12:28:16,0,0
4,771851,C,2023-04-28 12:28:26,849477,209,849436,998462,1,N,2023-04-28 12:28:26,0,0
5,771864,C,2023-04-28 12:28:32,849670,239,849436,998463,0,N,2023-04-28 12:28:32,0,0
6,771894,C,2023-04-28 12:28:46,849682,247,847375,998689,0,N,2023-04-28 12:28:46,0,0
7,771908,C,2023-04-28 12:28:55,849446,146,849436,998464,0,N,2023-04-28 12:28:55,0,0
8,771912,C,2023-04-28 12:28:57,849479,228,847375,998691,0,N,2023-04-28 12:28:57,0,0
9,771927,C,2023-04-28 12:29:05,849864,188,847375,998693,0,N,2023-04-28 12:29:05,0,0

<<<<<<<<<<accounts_userwithdraw>>>>>>>>>>

   id        reason          created_at
0  42   재밌는 질문이 없어서 2023-03-29 13:22:12
1  43  함께 할 친구가 없어서 2023-03-29 13:24:59
2  44  함께 할 친구가 없어서 2023-03-29 13:53:32
3  45  함께 할 친구가 없어서 2023-03-29 13:54:03
4  46   재밌는 질문이 없어서 2023-03-30 00:31:19
5  47         기타 이유 2023-03-30 00:34:23
6  48         기타 이유 2023-03-30 04:26:56
7  49   재밌는 질문이 없어서 2023-03-31 11:28:33
8  50   재밌는 질문이 없어서 2023-03-31 11:30:32
9  51          test 2023-03-31 11:45:11

<<<<<<<<<<event_receipts>>>>>>>>>>

   id          created_at  event_id  user_id  plus_point
0   2 2023-06-22 09:25:16         1  1193618         500
1   3 2023-06-22 09:38:53         1   928351         500
2   4 2023-06-22 10:32:15         1   904872         500
3   5 2023-06-22 13:03:06         1   974697         500
4   6 2023-06-22 13:40:38         1  1168260         500
5   8 2023-06-22 14:38:39         1  1190259         500
6   9 2023-06-22 17:44:12         1  1574322         500
7  10 2023-06-22 18:03:29         1  1085791         500
8  11 2023-06-22 22:08:40         1  1557673         500
9  12 2023-06-22 22:36:01         1  1514465         500

<<<<<<<<<<events>>>>>>>>>>

   id           title  plus_point event_type  is_expired          created_at
0   1   코드잇 은행 가입 이벤트         500       FCFS           1 2023-06-20 11:56:38
1   2  코드잇 멤버십 가입 이벤트        1000       FCFS           1 2023-08-08 07:43:45
2   3   예고 영상 기대평 이벤트         500       FCFS           1 2023-09-24 17:05:59

<<<<<<<<<<polls_question>>>>>>>>>>

    id                 question_text          created_at
0   99            가장 신비한 매력이 있는 사람은? 2023-03-31 15:22:53
1  100  "이 사람으로 한 번 살아보고 싶다" 하는 사람은? 2023-03-31 15:22:53
2  101                     미래의 틱톡커는? 2023-03-31 15:22:54
3  102               여기서 제일 특이한 친구는? 2023-03-31 15:22:54
4  103               가장 지켜주고 싶은 사람은? 2023-03-31 15:22:55
5  104           내 어깨를 내어줄 수 있는 사람은? 2023-03-31 15:22:56
6  105            볼 한 번 눌러보고 싶은 사람은? 2023-03-31 15:22:57
7  106          은근히 애교가 많을 것 같은 사람은? 2023-03-31 15:22:57
8  107       누가 봐도 좋아할 것 같은 호감인 사람은? 2023-03-31 15:22:57
9  108                  가장 매력적인 사람은? 2023-03-31 15:22:58

<<<<<<<<<<polls_questionpiece>>>>>>>>>>

       id  is_voted          created_at  question_id  is_skipped
0  998458         1 2023-04-28 12:27:22          252           0
1  998459         1 2023-04-28 12:27:22          244           0
2  998460         1 2023-04-28 12:27:22          183           0
3  998461         1 2023-04-28 12:27:22          101           0
4  998462         1 2023-04-28 12:27:22          209           0
5  998463         1 2023-04-28 12:27:22          239           0
6  998464         1 2023-04-28 12:27:22          146           0
7  998465         1 2023-04-28 12:27:22          297           0
8  998466         1 2023-04-28 12:27:22          294           0
9  998467         1 2023-04-28 12:27:22          201           0

<<<<<<<<<<polls_questionreport>>>>>>>>>>

   id                reason          created_at  question_id  user_id
0   1           이 질문은 재미없어요 2023-04-19 06:20:35          250   837556
1   2           이 질문은 재미없어요 2023-04-19 06:58:09          113   837672
2   3       불쾌한 내용이 포함되어 있음 2023-04-19 06:58:17          113   837672
3   4  어떻게 이런 생각을? 이 질문 최고! 2023-04-19 08:12:42          119   837922
4   5  어떻게 이런 생각을? 이 질문 최고! 2023-04-19 08:12:50          119   837922
5   6  어떻게 이런 생각을? 이 질문 최고! 2023-04-19 08:12:54          119   837922
6   7  어떻게 이런 생각을? 이 질문 최고! 2023-04-19 09:00:35          283   837737
7   8  어떻게 이런 생각을? 이 질문 최고! 2023-04-19 09:35:34          194   837697
8   9                    기타 2023-04-19 10:36:41          112   838119
9  10                    기타 2023-04-19 12:37:02          218   837565

<<<<<<<<<<polls_questionset>>>>>>>>>>

,id,question_piece_id_list,opening_time,status,created_at,user_id
0,99817,"[998458, 998459, 998460, 998461, 998462, 99846...",2023-04-28 12:27:22,F,2023-04-28 12:27:23,849436
1,99830,"[998588, 998589, 998590, 998591, 998592, 99859...",2023-04-28 12:28:07,F,2023-04-28 12:28:07,849438
2,99840,"[998689, 998691, 998693, 998695, 998697, 99869...",2023-04-28 12:28:38,F,2023-04-28 12:28:38,847375
3,99841,"[998688, 998690, 998692, 998694, 998696, 99869...",2023-04-28 12:28:38,F,2023-04-28 12:28:38,849446
4,99848,"[998768, 998769, 998770, 998771, 998772, 99877...",2023-04-28 12:28:57,F,2023-04-28 12:28:57,849477
5,99852,"[998808, 998809, 998810, 998811, 998813, 99881...",2023-04-28 12:29:04,F,2023-04-28 12:29:04,849469
6,99854,"[998828, 998829, 998830, 998831, 998832, 99883...",2023-04-28 12:29:05,F,2023-04-28 12:29:05,849682
7,99863,"[998918, 998919, 998920, 998921, 998922, 99892...",2023-04-28 12:32:16,F,2023-04-28 12:29:34,849436
8,99865,"[998938, 998939, 998940, 998941, 998942, 99894...",2023-04-28 12:29:40,F,2023-04-28 12:29:40,849479
9,99866,"[998948, 998949, 998950, 998951, 998952, 99895...",2023-04-28 12:29:43,F,2023-04-28 12:29:43,849441

<<<<<<<<<<polls_usercandidate>>>>>>>>>>

        id          created_at  question_piece_id  user_id
0  3088872 2023-04-28 12:27:49             998458   849444
1  3088873 2023-04-28 12:27:49             998458   849454
2  3088874 2023-04-28 12:27:49             998458   849460
3  3088875 2023-04-28 12:27:49             998458   849469
4  3088964 2023-04-28 12:28:02             998459   849446
5  3088965 2023-04-28 12:28:02             998459   849466
6  3088966 2023-04-28 12:28:02             998459   849497
7  3088967 2023-04-28 12:28:02             998459   849498
8  3089012 2023-04-28 12:28:09             998460   838642
9  3089013 2023-04-28 12:28:09             998460   849445

## accounts_attendance

In [4]:
accounts_attendance.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 349637 entries, 0 to 349636
Data columns (total 3 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   id                    349637 non-null  int64
 1   attendance_date_list  349637 non-null  object
 2   user_id               349637 non-null  int64
dtypes: int64(2), object(1)
memory usage: 8.0+ MB

In [ ]:
print(accounts_attendance.shape)
print(accounts_attendance['user_id'].nunique())

accounts = accounts_attendance.copy()
# JSON 파싱 (속도 빠름)
accounts['attendance_date_list'] = accounts['attendance_date_list'].apply(json.loads)

# 출석일 수 계산
accounts['attendance_count'] = accounts['attendance_date_list'].apply(len)

accounts.describe(include='all')

(349637, 3)
349637

## accounts_blockrecord

In [ ]:
display(accounts_blockrecord.head())
print(accounts_blockrecord.isna().sum())
display(accounts_blockrecord.describe(include='all'))
print(accounts_blockrecord['reason'].value_counts())

## accounts_failpaymenthistory

In [ ]:
display(accounts_failpaymenthistory.head())
print(accounts_failpaymenthistory.isna().sum())
display(accounts_failpaymenthistory.describe(include='all'))
print(accounts_failpaymenthistory['productId'].value_counts())

## accounts_friendrequest

In [ ]:
display(accounts_friendrequest.head())
print(accounts_friendrequest.isna().sum())
display(accounts_friendrequest.describe(include='all'))
print(accounts_friendrequest['status'].value_counts())

## accounts_group

In [ ]:
display(accounts_group.head())
print(accounts_group.isna().sum())
display(accounts_group.describe(include='all'))

## accounts_nearbyschool

In [ ]:
display(accounts_nearbyschool.head())
print(accounts_nearbyschool.isna().sum())
display(accounts_nearbyschool.describe(include='all'))

## accounts_paymenthistory

In [ ]:
display(accounts_paymenthistory.head())
print(accounts_paymenthistory.isna().sum())
display(accounts_paymenthistory.describe(include='all'))

## accounts_user_contacts

In [ ]:
display(accounts_paymenthistory.head())
print(accounts_paymenthistory.isna().sum())
display(accounts_paymenthistory.describe(include='all'))

## accounts_pointhistory

In [ ]:
display(accounts_pointhistory.head())
print(accounts_pointhistory.isna().sum())
display(accounts_pointhistory.describe(include='all'))

## accounts_school

In [ ]:
display(accounts_school.head())
print(accounts_school.isna().sum())
display(accounts_school.describe(include='all'))

## accounts_timelinereport

In [ ]:
display(accounts_timelinereport.head())
print(accounts_timelinereport.isna().sum())
display(accounts_timelinereport.describe(include='all'))

## accounts_user

In [ ]:
display(accounts_user.head())
print(accounts_user.isna().sum())
display(accounts_user.describe(include='all'))

## accounts_userquestionrecord

In [ ]:
display(accounts_userquestionrecord.head())
print(accounts_userquestionrecord.isna().sum())
display(accounts_userquestionrecord.describe(include='all'))

## accounts_userwithdraw

In [ ]:
display(accounts_userwithdraw.head())
print(accounts_userwithdraw.isna().sum())
display(accounts_userwithdraw.describe(include='all'))
display(accounts_userwithdraw['reason'].value_counts())